Revit 2024 API
DetailEllipse Class
Represents a DetailEllipse within Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class DetailEllipse : DetailCurve
Visual Basic
Public Class DetailEllipse _
	Inherits DetailCurve
Visual C++
public ref class DetailEllipse : public DetailCurve
Remarks
Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from DetailCurve::geometryCurve property.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.DetailCurve
 Autodesk.Revit.DB.DetailEllipse
See Also
DetailEllipse Members
Autodesk.Revit.DB Namespace